package org.example.tests;

import org.junit.jupiter.api.Test;

public class StoreManagerTests {

    @Test
    void firstApiTest() {
        /*
        В рамках этого теста нам потребуется реализовать первый API запрос и проверить результаты.

        1. Сначала можно написать первичную версию и убедиться, что запрос в целом работает
        2. Далее можно немного улучшать
        3. Добавляем сериализацию и десериализацию
        4. Используем константы с URL приложения и эндпоинтом
        5. Выносим отправку запроса в отдельный метод для более удобного использования
         */
    }

}
